# Given Baseline Model

[캐글 노트북](https://www.kaggle.com/subinium/kakr-16-lines-baseline)

결과 : 0.81255

In [16]:
import numpy as np 
import pandas as pd
from category_encoders.ordinal import OrdinalEncoder
from sklearn.tree import DecisionTreeClassifier

In [20]:
train = pd.read_csv('Data/train.csv')
test = pd.read_csv('Data/test.csv')
sample_submission = pd.read_csv('Data/sample_submission.csv')

In [27]:
train.head(2)

,id,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,income
0,0,40,Private,168538,HS-grad,9,Married-civ-spouse,Sales,Husband,White,Male,0,0,60,United-States,>50K
1,1,17,Private,101626,9th,5,Never-married,Machine-op-inspct,Own-child,White,Male,0,0,20,United-States,<=50K

In [28]:
test.head(2)

,id,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country
0,0,28,Private,67661,Some-college,10,Never-married,Adm-clerical,Other-relative,White,Female,0,0,40,United-States
1,1,40,Self-emp-inc,37869,HS-grad,9,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,50,United-States

In [29]:
sample_submission.head(2)

   id  prediction
0   0           0
1   1           0

In [26]:
len(train), len(test), len(sample_submission)

(26049, 6512, 6512)

In [30]:
target = train['income'] != '<=50K'
train.drop(['income'], axis=1, inplace=True)

In [32]:
target.head(2)

0     True
1    False
Name: income, dtype: bool

In [33]:
train.head(2)

,id,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country
0,0,40,Private,168538,HS-grad,9,Married-civ-spouse,Sales,Husband,White,Male,0,0,60,United-States
1,1,17,Private,101626,9th,5,Never-married,Machine-op-inspct,Own-child,White,Male,0,0,20,United-States

In [34]:
LE_encoder = OrdinalEncoder(list(train.columns))
train_le = LE_encoder.fit_transform(train, target)
test_le = LE_encoder.transform(test)

In [45]:
train_le.head(2)

,id,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country
0,0,40,1,168538,1,9,1,1,1,1,1,0,0,60,1
1,1,17,1,101626,2,5,2,2,2,1,1,0,0,20,1

In [43]:
LE_encoder.category_mapping

[{'col': 'workclass',
  'mapping': Private             1
  State-gov           2
  ?                   3
  Self-emp-not-inc    4
  Local-gov           5
  Federal-gov         6
  Self-emp-inc        7
  Without-pay         8
  Never-worked        9
  NaN                -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'education',
  'mapping': HS-grad          1
  9th              2
  Some-college     3
  Bachelors        4
  11th             5
  1st-4th          6
  5th-6th          7
  Assoc-acdm       8
  10th             9
  Prof-school     10
  7th-8th         11
  Masters         12
  Assoc-voc       13
  Doctorate       14
  12th            15
  Preschool       16
  NaN             -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'marital_status',
  'mapping': Married-civ-spouse       1
  Never-married            2
  Separated                3
  Married-spouse-absent    4
  Divorced                 5
  Widowed                  6
  Married-AF-spouse        7
  NaN                     -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'occupation',
  'mapping': Sales                 1
  Machine-op-inspct     2
  Other-service         3
  Prof-specialty        4
  Adm-clerical          5
  Craft-repair          6
  ?                     7
  Handlers-cleaners     8
  Farming-fishing       9
  Exec-managerial      10
  Transport-moving     11
  Protective-serv      12
  Tech-support         13
  Priv-house-serv      14
  Armed-Forces         15
  NaN                  -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'relationship',
  'mapping': Husband           1
  Own-child         2
  Not-in-family     3
  Unmarried         4
  Wife              5
  Other-relative    6
  NaN              -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'race',
  'mapping': White                 1
  Black                 2
  Asian-Pac-Islander    3
  Other                 4
  Amer-Indian-Eskimo    5
  NaN                  -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'sex',
  'mapping': Male      1
  Female    2
  NaN      -2
  dtype: int64,
  'data_type': dtype('O')},
 {'col': 'native_country',
  'mapping': United-States                  1
  ?                              2
  Mexico                         3
  Poland                         4
  Philippines                    5
  Puerto-Rico                    6
  Vietnam                        7
  Germany                        8
  Cuba                           9
  France                        10
  Ireland                       11
  El-Salvador                   12
  Guatemala                     13
  Haiti                         14
  Trinadad&Tobago               15
  Jamaica                       16
  Canada                        17
  Taiwan                        18
  South                         19
  Columbia                      20
  Peru                          21
  Japan                         22
  Dominican-Republic            23
  China                         24
  England                       25
  Iran                          26
  India                         27
  Nicaragua                     28
  Italy                         29
  Honduras                      30
  Thailand                      31
  Ecuador                       32
  Portugal                      33
  Hungary                       34
  Greece                        35
  Hong                          36
  Outlying-US(Guam-USVI-etc)    37
  Cambodia                      38
  Scotland                      39
  Yugoslavia                    40
  Laos                          41
  NaN                           -2
  dtype: int64,
  'data_type': dtype('O')}]

In [46]:
lr_clf = DecisionTreeClassifier()
lr_clf.fit(train_le, target)

DecisionTreeClassifier()

In [48]:
train_preds = lr_clf.predict(train_le)
train_preds

array([ True, False, False, ..., False, False, False])

In [62]:
sample_submission['prediction'] = lr_clf.predict(test_le).astype(int)
sample_submission.to_csv('Data/submission_basemodel.csv', index=False)

Basemodel 제출

In [63]:
!kaggle competitions submit -c kakr-4th-competition -f Data/submission_basemodel.csv -m 'Basemodel'

100%|██████████████████████████████████████| 43.4k/43.4k [00:04<00:00, 9.06kB/s]
Successfully submitted to [T-Academy X KaKr] 성인 인구조사 소득 예측 대회